espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm220pc22hna.h
/* Common peripheral register block offsets. */
#define PER_REG_BLOCK_SET_OFFSET                0x1000UL  /**< Offset to SET register block */
#define PER_REG_BLOCK_CLR_OFFSET                0x2000UL  /**< Offset to CLEAR register block */
#define PER_REG_BLOCK_TGL_OFFSET                0x3000UL  /**< Offset to TOGGLE register block */
#define MSC_CDA_PRESENT                         0x0UL     /**>  */
#define MSC_FDIO_WIDTH                          0x40UL    /**> None */
#define MSC_FLASHADDRBITS                       0x13UL    /**> None */
#define MSC_FLASHBLOCKADDRBITS                  0x13UL    /**> None */
#define MSC_FLASH_BLOCK_INFO_PCOUNT             0x6UL     /**> None */
#define MSC_INFOADDRBITS                        0x10UL    /**> None */
#define MSC_INFOBLOCKADDRBITS                   0x10UL    /**> None */
#define MSC_INFO_PSIZE_BITS                     0xDUL     /**> None */
#define MSC_MAIN_PSIZE_BITS                     0xDUL     /**> None */
#define MSC_MTP_PRESENT                         0x1UL     /**>  */
#define MSC_REDUNDANCY                          0x2UL     /**> None */
#define MSC_UD_IN_MTP_PAGE                      0x0UL     /**>  */
#define MSC_YADDRBITS                           0x6UL     /**>  */
#define SYSROM_WORDS                            0x600UL   /**> Number of words in ROM */
#define SYSROM_ROM_SIZE_BYTES                   0x1800UL  /**> Number of bytes in ROM */
#define DMEM_BANK0_SIZE                         0x6000UL  /**> Bank0 Size */
#define DMEM_BANK1_SIZE                         0x2000UL  /**> Bank1 Size */
#define DMEM_BANK2_SIZE                         0x0UL     /**> Bank2 Size */
#define DMEM_BANK3_SIZE                         0x0UL     /**> Bank3 Size */
#define DMEM_BANK4_SIZE                         0x0UL     /**> Bank4 Size */
#define DMEM_BANK5_SIZE                         0x0UL     /**> Bank5 Size */
#define DMEM_BANK6_SIZE                         0x0UL     /**> Bank6 Size */
#define DMEM_BANK7_SIZE                         0x0UL     /**> Bank7 Size */
#define DMEM_NUM_BANKS                          0x2UL     /**> Number of Banks */
#define DMEM_SIZE                               0x8000UL  /**> Total size */
#define LFXO_NO_CTUNE                           0x0UL     /**> CTUNE Not Present */
#define LFXO_CTUNE                              0x1UL     /**> CTUNE Present */
#define ICACHE0_AHB_LITE                        0x0UL     /**> AHB Lite */
#define ICACHE0_CACHEABLE_SIZE                  0x200UL   /**> Cache Size */
#define ICACHE0_CACHEABLE_START                 0x12UL    /**> Cache Start */
#define ICACHE0_DEFAULT_OFF                     0x1UL     /**> Default off */
#define ICACHE0_FLASH_SIZE                      0x80000UL /**> Flash size */
#define ICACHE0_FLASH_START                     0x0UL     /**> Flash start */
#define ICACHE0_LOOPCACHE_MEM_ADDR_BITS         0x3UL     /**> Loopcache Memory Address bits */
#define ICACHE0_LOOPCACHE_STICKINESS_BITS       0x4UL     /**> Loopcache Stickiness bits */
#define ICACHE0_PARITY_BITS                     0x1UL     /**> Use Parity */
#define ICACHE0_PC_BITS                         0x20UL    /**> Performance Counter bits */
#define ICACHE0_PIPE_STAGE                      0x1UL     /**> Pipeline Stage */
#define ICACHE0_RAM_ADDR_BITS                   0x0UL     /**> RAM Address bits */
#define ICACHE0_RAM_DATA_BITS                   0x0UL     /**> RAM Data bits */
#define ICACHE0_SET_BITS                        0x5UL     /**> Set bits */
#define ICACHE0_USE_HREADY_GATING               0x1UL     /**> Use HREADY gating */
#define ICACHE0_USE_IDLE_GATING                 0x1UL     /**> Use IDLE gating */
#define ICACHE0_USE_LOOPCACHE                   0x1UL     /**> Use Loopcache */
#define ICACHE0_WAY_BITS                        0x1UL     /**> Way bits */
#define ICACHE0_WORDS_PER_BLOCK                 0x0UL     /**> Words Per Block */
#define ICACHE0_WPB_BITS                        0x1UL     /**> Words Per Block bits */
#define ICACHE0_WPL_BITS                        0x3UL     /**> Words Per Line bits */
#define PRS_ASYNC_CH_NUM                        0xCUL     /**> None */
#define PRS_PRSSEL_WIDTH                        0x4UL     /**> New Param */
#define PRS_SPRSSEL_WIDTH                       0x2UL     /**> New Param */
#define PRS_SYNC_CH_NUM                         0x4UL     /**> None */
#define GPIO_MODE_WIDTH                         0x4UL     /**> Mode Width */
#define GPIO_NUM_EM4_WU                         0xCUL     /**> New Param */
#define GPIO_NUM_EVEN_PA                        0x5UL     /**> Num of even pins port A */
#define GPIO_NUM_EVEN_PB                        0x3UL     /**> Num of even pins port B */
#define GPIO_NUM_EVEN_PC                        0x4UL     /**> Num of even pins port C */
#define GPIO_NUM_EVEN_PD                        0x2UL     /**> Num of even pins port D */
#define GPIO_NUM_EXT_INT                        0xCUL     /**> New Param */
#define GPIO_NUM_EXT_INT_L                      0x8UL     /**> New Param */
#define GPIO_NUM_EXT_INT_U                      0x4UL     /**> New Param */
#define GPIO_NUM_EXT_INT_U_ZERO                 0x0UL     /**> New Param */
#define GPIO_NUM_ODD_PA                         0x4UL     /**> Num of odd pins port A */
#define GPIO_NUM_ODD_PB                         0x2UL     /**> Num of odd pins port B */
#define GPIO_NUM_ODD_PC                         0x4UL     /**> Num of odd pins port C */
#define GPIO_NUM_ODD_PD                         0x2UL     /**> Num of odd pins port D */
#define GPIO_PINSEL_WIDTH                       0x4UL     /**> Route config pin select width */
#define GPIO_PORTSEL_WIDTH                      0x2UL     /**> Route config port select width */
#define GPIO_PORT_A_WIDTH                       0x9UL     /**> Port A Width */
#define GPIO_PORT_A_WIDTH_ZERO                  0x0UL     /**> Port A Width is Zero */
#define GPIO_PORT_A_WL                          0x8UL     /**> New Param */
#define GPIO_PORT_A_WU                          0x1UL     /**> New Param */
#define GPIO_PORT_A_WU_ZERO                     0x0UL     /**> New Param */
#define GPIO_PORT_B_WIDTH                       0x5UL     /**> Port B Width */
#define GPIO_PORT_B_WIDTH_ZERO                  0x0UL     /**> Port B Width is Zero */
#define GPIO_PORT_B_WL                          0x5UL     /**> New Param */
#define GPIO_PORT_B_WU                          0x0UL     /**> New Param */
#define GPIO_PORT_B_WU_ZERO                     0x1UL     /**> New Param */
#define GPIO_PORT_C_WIDTH                       0x8UL     /**> Port C Width */
#define GPIO_PORT_C_WIDTH_ZERO                  0x0UL     /**> Port C Width is Zero */
#define GPIO_PORT_C_WL                          0x8UL     /**> New Param */
#define GPIO_PORT_C_WU                          0x0UL     /**> New Param */
#define GPIO_PORT_C_WU_ZERO                     0x1UL     /**> New Param */
#define GPIO_PORT_D_WIDTH                       0x4UL     /**> Port D Width */
#define GPIO_PORT_D_WIDTH_ZERO                  0x0UL     /**> Port D Width is Zero */
#define GPIO_PORT_D_WL                          0x4UL     /**> New Param */
#define GPIO_PORT_D_WU                          0x0UL     /**> New Param */
#define GPIO_PORT_D_WU_ZERO                     0x1UL     /**> New Param */
#define GPIO_SLEWRATE_WIDTH                     0x3UL     /**> Slew Rate Width Param */
#define LDMA_CH_BITS                            0x5UL     /**> New Param */
#define LDMA_CH_NUM                             0x8UL     /**> New Param */
#define LDMA_FIFO_BITS                          0x5UL     /**> New Param */
#define LDMA_FIFO_DEPTH                         0x10UL    /**> New Param */
#define LDMAXBAR_CH_BITS                        0x5UL     /**> None */
#define LDMAXBAR_CH_NUM                         0x8UL     /**> None */
#define LDMAXBAR_SIGSEL_W                       0x4UL     /**> New Param */
#define LDMAXBAR_SOURCESEL_W                    0x6UL     /**> New Param */
#define TIMER0_CC_NUM                           0x3UL     /**> Number of Compare/Capture Channels */
#define TIMER0_CNTWIDTH                         0x20UL    /**> Counter Width */
#define TIMER0_DTI                              0x1UL     /**> Dead-time insertion enabled */
#define TIMER0_DTI_CC_NUM                       0x3UL     /**> Number of DTI Channels */
#define TIMER0_NO_DTI                           0x0UL     /**>  */
#define TIMER1_CC_NUM                           0x3UL     /**> Number of Compare/Capture Channels */
#define TIMER1_CNTWIDTH                         0x10UL    /**> Counter Width */
#define TIMER1_DTI                              0x1UL     /**> Dead-time insertion enabled */
#define TIMER1_DTI_CC_NUM                       0x3UL     /**> Number of DTI Channels */
#define TIMER1_NO_DTI                           0x0UL     /**>  */
#define TIMER2_CC_NUM                           0x3UL     /**> Number of Compare/Capture Channels */
#define TIMER2_CNTWIDTH                         0x10UL    /**> Counter Width */
#define TIMER2_DTI                              0x1UL     /**> Dead-time insertion enabled */
#define TIMER2_DTI_CC_NUM                       0x3UL     /**> Number of DTI Channels */
#define TIMER2_NO_DTI                           0x0UL     /**>  */
#define TIMER3_CC_NUM                           0x3UL     /**> Number of Compare/Capture Channels */
#define TIMER3_CNTWIDTH                         0x10UL    /**> Counter Width */
#define TIMER3_DTI                              0x1UL     /**> Dead-time insertion enabled */
#define TIMER3_DTI_CC_NUM                       0x3UL     /**> Number of DTI Channels */
#define TIMER3_NO_DTI                           0x0UL     /**>  */
#define TIMER4_CC_NUM                           0x3UL     /**> Number of Compare/Capture Channels */
#define TIMER4_CNTWIDTH                         0x10UL    /**> Counter Width */
#define TIMER4_DTI                              0x1UL     /**> Dead-time insertion enabled */
#define TIMER4_DTI_CC_NUM                       0x3UL     /**> Number of DTI Channels */
#define TIMER4_NO_DTI                           0x0UL     /**>  */
#define USART0_AUTOTX_REG                       0x1UL     /**> None */
#define USART0_AUTOTX_REG_B                     0x0UL     /**> None */
#define USART0_AUTOTX_TRIGGER                   0x1UL     /**> None */
#define USART0_AUTOTX_TRIGGER_B                 0x0UL     /**> New Param */
#define USART0_CLK_PRS                          0x1UL     /**> None */
#define USART0_CLK_PRS_B                        0x0UL     /**> New Param */
#define USART0_FLOW_CONTROL                     0x1UL     /**> None */
#define USART0_FLOW_CONTROL_B                   0x0UL     /**> New Param */
#define USART0_I2S                              0x1UL     /**> None */
#define USART0_I2S_B                            0x0UL     /**> New Param */
#define USART0_IRDA_AVAILABLE                   0x1UL     /**> None */
#define USART0_IRDA_AVAILABLE_B                 0x0UL     /**> New Param */
#define USART0_MVDIS_FUNC                       0x1UL     /**> None */
#define USART0_MVDIS_FUNC_B                     0x0UL     /**> New Param */
#define USART0_RX_PRS                           0x1UL     /**> None */
#define USART0_RX_PRS_B                         0x0UL     /**> New Param */
#define USART0_SC_AVAILABLE                     0x1UL     /**> None */
#define USART0_SC_AVAILABLE_B                   0x0UL     /**> New Param */
#define USART0_SYNC_AVAILABLE                   0x1UL     /**> None */
#define USART0_SYNC_AVAILABLE_B                 0x0UL     /**> New Param */
#define USART0_SYNC_LATE_SAMPLE                 0x1UL     /**> None */
#define USART0_SYNC_LATE_SAMPLE_B               0x0UL     /**> New Param */
#define USART0_TIMER                            0x1UL     /**> New Param */
#define USART0_TIMER_B                          0x0UL     /**> New Param */
#define USART1_AUTOTX_REG                       0x1UL     /**> None */
#define USART1_AUTOTX_REG_B                     0x0UL     /**> None */
#define USART1_AUTOTX_TRIGGER                   0x1UL     /**> None */
#define USART1_AUTOTX_TRIGGER_B                 0x0UL     /**> New Param */
#define USART1_CLK_PRS                          0x1UL     /**> None */
#define USART1_CLK_PRS_B                        0x0UL     /**> New Param */
#define USART1_FLOW_CONTROL                     0x1UL     /**> None */
#define USART1_FLOW_CONTROL_B                   0x0UL     /**> New Param */
#define USART1_I2S                              0x1UL     /**> None */
#define USART1_I2S_B                            0x0UL     /**> New Param */
#define USART1_IRDA_AVAILABLE                   0x1UL     /**> None */
#define USART1_IRDA_AVAILABLE_B                 0x0UL     /**> New Param */
#define USART1_MVDIS_FUNC                       0x1UL     /**> None */
#define USART1_MVDIS_FUNC_B                     0x0UL     /**> New Param */
#define USART1_RX_PRS                           0x1UL     /**> None */
#define USART1_RX_PRS_B                         0x0UL     /**> New Param */
#define USART1_SC_AVAILABLE                     0x1UL     /**> None */
#define USART1_SC_AVAILABLE_B                   0x0UL     /**> New Param */
#define USART1_SYNC_AVAILABLE                   0x1UL     /**> None */
#define USART1_SYNC_AVAILABLE_B                 0x0UL     /**> New Param */
#define USART1_SYNC_LATE_SAMPLE                 0x1UL     /**> None */
#define USART1_SYNC_LATE_SAMPLE_B               0x0UL     /**> New Param */
#define USART1_TIMER                            0x1UL     /**> New Param */
#define USART1_TIMER_B                          0x0UL     /**> New Param */
#define BURTC_CNTWIDTH                          0x20UL    /**> None */
#define BURTC_PRECNT_WIDTH                      0xFUL     /**>  */
#define I2C1_DELAY                              0x7D0UL   /**> Delay cell selection */
#define I2C1_DELAY_CHAIN_NUM                    0x2UL     /**> Number of delay chain */
#define SYSCFG_CHIP_FAMILY                      0x34UL    /**> CHIP Family */
#define SYSCFG_DEMODRAM_INST_COUNT              0x1UL     /**>  */
#define SYSCFG_FRCRAM_INST_COUNT                0x1UL     /**>  */
#define SYSCFG_RAM0_INST_COUNT                  0x2UL     /**> None */
#define SYSCFG_SEQRAM_INST_COUNT                0x2UL     /**> None */
#define SYSCFG_SWINT_NUM                        0x4UL     /**> Software interupts */
#define DCDC_DCDCMODE_WIDTH                     0x1UL     /**> Mode register width */
#define DCDC_DRVSPEED_WIDTH                     0x2UL     /**> Drive Speed bitfield width */
#define DCDC_IPKVAL_WIDTH                       0x4UL     /**> Peak Current Setting bitfield Width */
#define DCDC_VCMPIBIAS_WIDTH                    0x2UL     /**> VCMP ibias bitfield width */
#define PDM_FIFO_LEN                            0x4UL     /**> New Param */
#define PDM_NUM_CH                              0x2UL     /**> None */
#define PDM_CH2_PRESENT_B                       0x1UL     /**> New Param */
#define PDM_CH3_PRESENT_B                       0x1UL     /**> New Param */
#define PDM_NUM_CH_WIDTH                        0x1UL     /**> New Param */
#define PDM_PIPELINE                            0x0UL     /**> None */
#define PDM_STEREO23_PRESENT_B                  0x1UL     /**> New Param */
#define RADIOAES_SIDECHANNEL_COUNTERMEASURES    0x0UL     /**> Enable sidechannel counter measures */
#define SMU_NUM_BMPUS                           0x5UL     /**> Number of BMPUs */
#define SMU_NUM_PPU_PERIPHS                     0x30UL    /**> Number of PPU Peripherals */
#define SMU_NUM_PPU_PERIPHS_MOD_32              0x10UL    /**> Number of PPU Peripherals (mod 32) */
#define SMU_NUM_PPU_PERIPHS_SUB_32              0x10UL    /**> Number of PPU peripherals minus 32 */
#define SMU_PERIPHID_BITS                       0x8UL     /**> Bits used for Peripheral ID */
#define RTCC_CC_NUM                             0x3UL     /**> None */
#define LETIMER0_CNT_WIDTH                      0x18UL    /**> Count Width */
#define IADC0_CONFIGNUM                         0x2UL     /**> CONFIG */
#define IADC0_FULLRANGEUNIPOLAR                 0x0UL     /**> FULLRANGEUNIPOLAR */
#define IADC0_SCANBYTES                         0x1UL     /**> SCANBYTES */
#define IADC0_ENTRIES                           0x10UL    /**> ENTRIES */
#define I2C0_DELAY                              0x3E8UL   /**> Delay cell selection */
#define I2C0_DELAY_CHAIN_NUM                    0x2UL     /**> Number of delay chain */
#define WDOG0_PCNUM                             0x2UL     /**> None */
#define AMUXCP0_AMUXCPNUM                       0x0UL     /**> AMUXCPNUM */
#define EUART0_USE_AS_LEUART                    0x1UL     /**> LEUART instace */
#define EUART0_USE_AS_UART                      0x0UL     /**> UART instance */
#define RDMEM_FRC_BANK0_SIZE                    0x1000UL  /**> FRC_RAM_BANK0_SIZE */
#define RDMEM_FRC_BANK1_SIZE                    0x0UL     /**> FRC_RAM_BANK1_SIZE */
#define RDMEM_FRC_BANK2_SIZE                    0x0UL     /**> FRC_RAM_BANK2_SIZE */
#define RDMEM_FRC_BANK3_SIZE                    0x0UL     /**> FRC_RAM_BANK3_SIZE */
#define RDMEM_FRC_BANK4_SIZE                    0x0UL     /**> FRC_RAM_BANK4_SIZE */
#define RDMEM_FRC_BANK5_SIZE                    0x0UL     /**> FRC_RAM_BANK5_SIZE */
#define RDMEM_FRC_BANK6_SIZE                    0x0UL     /**> FRC_RAM_BANK6_SIZE */
#define RDMEM_FRC_BANK7_SIZE                    0x0UL     /**> FRC_RAM_BANK7_SIZE */
#define RDMEM_FRC_NUM_BANK                      0x1UL     /**> FRC_NUM_BANK */
#define RDMEM_FRC_RAMADDRBITS                   0xCUL     /**> FRC RAM ADDRBITS */
#define RDMEM_FRC_RAMADDRMINBITS                0xCUL     /**> FRC RAM address bits for one bank */
#define RDMEM_FRC_RAMECCADDR_WIDTH              0x20UL    /**> FRC RAM ECC Address width */
#define RDMEM_FRC_RAM_BWE_WIDTH                 0x27UL    /**> FRCRAM BWE width */
#define RDMEM_FRC_RAM_DATA_WIDTH                0x27UL    /**> FRC_RAM_DATA_WIDTH */
#define RDMEM_FRC_RAM_ECC_EN                    0x1UL     /**> FRC RAM ECCEN */
#define RDMEM_FRC_RAM_TOTAL_SIZE                0x1000UL  /**> FRC_RAM_TOTAL_SIZE */
#define RDMEM_SEQ_BANK0_SIZE                    0x2000UL  /**> SEQ_RAM_BANK0_SIZE */
#define RDMEM_SEQ_BANK1_SIZE                    0x2000UL  /**> SEQ_RAM_BANK1_SIZE */
#define RDMEM_SEQ_BANK2_SIZE                    0x0UL     /**> SEQ_RAM_BANK2_SIZE */
#define RDMEM_SEQ_BANK3_SIZE                    0x0UL     /**> SEQ_RAM_BANK3_SIZE */
#define RDMEM_SEQ_BANK4_SIZE                    0x0UL     /**> SEQ_RAM_BANK4_SIZE */
#define RDMEM_SEQ_BANK5_SIZE                    0x0UL     /**> SEQ_RAM_BANK5_SIZE */
#define RDMEM_SEQ_BANK6_SIZE                    0x0UL     /**> SEQ_RAM_BANK6_SIZE */
#define RDMEM_SEQ_BANK7_SIZE                    0x0UL     /**> SEQ_RAM_BANK7_SIZE */
#define RDMEM_SEQ_NUM_BANK                      0x2UL     /**> SEQ_NUM_BANK */
#define RDMEM_SEQ_RAMADDRBITS                   0xEUL     /**> SEQ RAM ADDRBITS */
#define RDMEM_SEQ_RAMADDRMINBITS                0xDUL     /**> SEQ RAM address bits for one bank */
#define RDMEM_SEQ_RAMECCADDR_WIDTH              0x20UL    /**> SEQ RAM ECC Address width */
#define RDMEM_SEQ_RAM_BWE_WIDTH                 0x27UL    /**> SEQRAM BWE width */
#define RDMEM_SEQ_RAM_DATA_WIDTH                0x27UL    /**> SEQ_RAM_DATA_WIDTH */
#define RDMEM_SEQ_RAM_ECC_EN                    0x1UL     /**> SEQ RAM ECCEN */
#define RDMEM_SEQ_RAM_TOTAL_SIZE                0x4000UL  /**> SEQ_RAM_TOTAL_SIZE */
#define PRORTC_CC_NUM                           0x2UL     /**> None */

